08-rails/moma/app/views/works/show.html.erb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]
---
  <li>Title: <%= @work.title %></li>
  <% if @work.artist.present? %>