08-rails/moma/app/controllers/artists_controller.rb

  def create
    artist = Artist.create artist_params
---
INSERT INTO "artists" ("name", "nationality", "dob", "period", "image") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Ken Done"], ["nationality", "Australian"], ["dob", "1950-01-25"], ["period", ""], ["image", "https://www.talkingwithpainters.com/wp-content/uploads/2017/10/P1010042.ORF-8-1200x530.jpg"]]

  def edit
    @artist = Artist.find params[:id]
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    artist = Artist.find params[:id]
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def show
    @artist = Artist.find params[:id]
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def destroy
    artist = Artist.find params[:id]
    artist.destroy
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
DELETE FROM "artists" WHERE "artists"."id" = $1  [["id", 8]]