08-rails/solar_system/app/controllers/planets_controller.rb

  def show
    @planet = Planet.find params[:id]
---
SELECT  "planets".* FROM "planets" WHERE "planets"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

  def create
    # create the planet
    planet = Planet.create :name => params[:name], :image => params[:image], :orbit => params[:orbit], :diameter => params[:diameter], :mass => params[:mass], :moons => params[:moons]
---
INSERT INTO "planets" ("name", "image") VALUES (?, ?)  [["name", "Saturn"], ["image", "https://cdn.images.express.co.uk/img/dynamic/151/590x/Saturn-at-night-how-to-see-Saturn-rings-astronomy-saturn-opposition-closest-Earth-1150859.jpg?r=1562770321805"]]

  def edit
    @planet = Planet.find params[:id]
---
SELECT  "planets".* FROM "planets" WHERE "planets"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]

  def update
    planet = Planet.find params[:id]
---
SELECT  "planets".* FROM "planets" WHERE "planets"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]

  def destroy
    planet = Planet.find params[:id]
    planet.destroy
---
SELECT  "planets".* FROM "planets" WHERE "planets"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
DELETE FROM "planets" WHERE "planets"."id" = ?  [["id", 9]]