08-rails/tunr/app/controllers/mixtapes_controller.rb

  def create
    # One step alternative:
    # @current_user.mixtapes.create mixtape_params

    mixtape = Mixtape.create mixtape_params
---
INSERT INTO "mixtapes" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "It's just a cold"], ["created_at", "2020-03-12 23:03:11.603750"], ["updated_at", "2020-03-12 23:03:11.603750"]]