08-rails/tunr/app/controllers/users_controller.rb

INSERT INTO "users" ("email", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4) RETURNING "id"  [["email", "m@g"], ["created_at", "2020-03-12 04:24:53.621338"], ["updated_at", "2020-03-12 04:24:53.621338"], ["password_digest", "$2a$12$i0DE4DskJA3mmVcJTD4V/ODVhj8rv0cm9TCAkdB4Few/argJlqWi."]]
---
  def create
    @user = User.new user_params
    if @user.save